module LineSelect
	def prefecture_to_line_select(pref)
		if pref == '01000'
        	{'中央線': '01100','山手線': '01200'}
        elsif pref  == '02000'
        	{'埼京線': '02100','東武東上線': '02200'}
        end
	end
	def line_to_station_select(line)
		if line == '01100'
        	{'新宿駅': '新宿駅','四ツ谷駅': '四ツ谷駅','御茶ノ水駅': '御茶ノ水駅','東京駅': '東京駅'}
        elsif line  == '01200'
        	{'渋谷駅': '渋谷駅','原宿駅': '原宿駅','代々木駅': '代々木駅','新宿駅': '新宿駅'}
        elsif line  == '02100'
        	{'戸田公園駅': '戸田公園駅','戸田駅': '戸田駅','北戸田駅': '北戸田駅','大宮駅': '大宮駅'}
        elsif line  == '02200'
        	{'和光市駅': '和光市駅','朝霞駅': '朝霞駅','朝霞台駅': '朝霞台駅','志木駅': '志木駅'}
        end
	end
end

